
<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      
      
      
      
        <link rel="prev" href="../2024-01-16/">
      
      
        <link rel="next" href="../Freertos%20API/">
      
      
      <link rel="icon" href="../assets/images/favicon.png">
      <meta name="generator" content="mkdocs-1.6.0, mkdocs-material-9.5.27">
    
    
      
        <title>C++内存布局 - My Docs</title>
      
    
    
      <link rel="stylesheet" href="../assets/stylesheets/main.6543a935.min.css">
      
      


    
    
      
    
    
      
        
        
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,300i,400,400i,700,700i%7CRoboto+Mono:400,400i,700,700i&display=fallback">
        <style>:root{--md-text-font:"Roboto";--md-code-font:"Roboto Mono"}</style>
      
    
    
    <script>__md_scope=new URL("..",location),__md_hash=e=>[...e].reduce((e,_)=>(e<<5)-e+_.charCodeAt(0),0),__md_get=(e,_=localStorage,t=__md_scope)=>JSON.parse(_.getItem(t.pathname+"."+e)),__md_set=(e,_,t=localStorage,a=__md_scope)=>{try{t.setItem(a.pathname+"."+e,JSON.stringify(_))}catch(e){}}</script>
    
      

    
    
    
  </head>
  
  
    <body dir="ltr">
  
    

              
            
              
                
  
  
  
  
    <li class="md-nav__item">
      <a href="../Linux%E9%A9%B1%E5%8A%A8/%E5%B8%B8%E8%A7%81%E7%9A%84OF%E5%87%BD%E6%95%B0%E8%AE%B0%E5%BD%95/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    常见的OF函数记录
  </span>
  

      </a>
    </li>
  

              
            
              
                
  
  
  
  
    <li class="md-nav__item">
      <a href="../Linux%E9%A9%B1%E5%8A%A8/%E8%AE%BE%E5%A4%87%E6%A0%91%E4%BB%8B%E7%BB%8D%E5%8F%8A%E5%85%B6%E8%AF%AD%E6%B3%95/" class="md-nav__link">
        
  
  <span class="md-ellipsis">
    设备树介绍及其语法
  </span>
  

      </a>
    </li>
  

              
            
          </ul>
        </nav>
      
    </li>
  

    
  </ul>
</nav>
                  </div>
                </div>
              </div>
            
            
              
              <div class="md-sidebar md-sidebar--secondary" data-md-component="sidebar" data-md-type="toc" >
                <div class="md-sidebar__scrollwrap">
                  <div class="md-sidebar__inner">
                    

<nav class="md-nav md-nav--secondary" aria-label="Table of contents">
  
  
  
    
  
  
    <label class="md-nav__title" for="__toc">
      <span class="md-nav__icon md-icon"></span>
      Table of contents
    </label>
    <ul class="md-nav__list" data-md-component="toc" data-md-scrollfix>
      
        <li class="md-nav__item">
  <a href="#11" class="md-nav__link">
    <span class="md-ellipsis">
      1.1 无虚函数
    </span>
  </a>
  
    <nav class="md-nav" aria-label="1.1 无虚函数">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_2" class="md-nav__link">
    <span class="md-ellipsis">
      布局：
    </span>
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
        <li class="md-nav__item">
  <a href="#12" class="md-nav__link">
    <span class="md-ellipsis">
      1.2 有虚函数
    </span>
  </a>
  
    <nav class="md-nav" aria-label="1.2 有虚函数">
      <ul class="md-nav__list">
        
          <li class="md-nav__item">
  <a href="#_3" class="md-nav__link">
    <span class="md-ellipsis">
      布局：
    </span>
  </a>
  
</li>
        
      </ul>
    </nav>
  
</li>
      
    </ul>
  
</nav>
                  </div>
                </div>
              </div>
            
          
          
            <div class="md-content" data-md-component="content">
              <article class="md-content__inner md-typeset">
                
                  


<p>Visual Studio：先选择左侧的C/C++-&gt;命令行，然后在其他选项这里写上/d1 reportAllClassLayout，它可以看到所有相关类的内存布局，如果写上/d1 reportSingleClassLayoutXXX（XXX为类名），则只会打出指定类XXX的内存布局</p>
<h1 id="_1">一、无继承</h1>
<h2 id="11">1.1 无虚函数</h2>
<pre><code>class Base
{
private:

    char c_a;

    static char c_b;

    int i_a;

    static int i_b;

    float f_a;

    static float f_b;

    double d_a;

public:

    void fun_1() {}

};
</code></pre>
<h3 id="_2">布局：</h3>
<pre><code>1&gt;class Base size(24):

1&gt; +---

1&gt; 0 | c_a

1&gt;   | &lt;alignment member&gt; (size=3)

1&gt; 4 | i_a

1&gt; 8 | f_a

1&gt;   | &lt;alignment member&gt; (size=4)

1&gt;16 | d_a

1&gt; +---
</code></pre>
<p>* 普通的变量 ：是要占用内存的，但是要注意对齐原则</p>
<ul>
<li>
<p>static修饰的静态变量 ：不占用内容，原因是编译器将其放在全局变量区</p>
</li>
<li>
<p>成员函数不占用具体类对象内存空间，成员函数存在代码区</p>
</li>
<li>
<p>数据成员的访问级别并不影响其在内存的排布和大小，均是按照声明的顺序在内存中有序排布，并适当对齐</p>
</li>
</ul>
<h2 id="12">1.2 有虚函数</h2>
<pre><code>class Base

{
private:

    char c_a;

    static char c_b;

    int i_a;

    static int i_b;

    float f_a;

    static float f_b;

    double d_a;

public:

    void fun_1() {}

    virtual void vfun_1() {}

    virtual void vfun_2() {}

};
</code></pre>
<h3 id="_3">布局：</h3>
<pre><code>1&gt;class Base size(32):

1&gt; +---

1&gt; 0 | {vfptr}

1&gt; 8 | c_a

1&gt;   | &lt;alignment member&gt; (size=3)

1&gt;12 | i_a

1&gt;16 | f_a

1&gt;   | &lt;alignment member&gt; (size=4)

1&gt;24 | d_a

1&gt; +---

1&gt;Base::$vftable@:

1&gt; | &amp;Base_meta

1&gt; |  0

1&gt; 0 | &amp;Base::vfun_1

1&gt; 1 | &amp;Base::vfun_2

1&gt;Base::vfun_1 this adjustor: 0

1&gt;Base::vfun_2 this adjustor: 0

</code></pre>
<h1 id="_4">二、单一继承</h1>
<h2 id="21">2.1 无虚函数</h2>
<pre><code>class Base

{

private:

    char c_a;

    static char c_b;

    int i_a;

    static int i_b;

    float f_a;

    static float f_b;

    double d_a;

public:

    void fun_1() {}

};

//Derived1类
class Derived1 : public Base
{

    char c_b;

public:

    void fun_d1() {}

};

//Derived2类
class Derived2 : public Derived1
{

    double d_b;

public:

    void fun_d2() {}

};
</code></pre>
<h3 id="_5">布局：</h3>
<pre><code>1&gt;class Base size(24):

1&gt; +---

1&gt; 0 | c_a

1&gt;   | &lt;alignment member&gt; (size=3)

1&gt; 4 | i_a

1&gt; 8 | f_a

1&gt;   | &lt;alignment member&gt; (size=4)

1&gt;16 | d_a

1&gt; +---

1&gt;class Derived1 size(32):

1&gt; +---

1&gt; 0 | +--- (base class Base)

1&gt; 0 | | c_a

1&gt;   | | &lt;alignment member&gt; (size=3)

1&gt; 4 | | i_a

1&gt; 8 | | f_a

1&gt;   | | &lt;alignment member&gt; (size=4)

1&gt;16 | | d_a

1&gt; | +---

1&gt;24 | c_b

1&gt;   | &lt;alignment member&gt; (size=7)

1&gt; +---

1&gt;class Derived2 size(40):

1&gt; +---

1&gt; 0 | +--- (base class Derived1)

1&gt; 0 | | +--- (base class Base)

1&gt; 0 | | | c_a

1&gt;   | | | &lt;alignment member&gt; (size=3)

1&gt; 4 | | | i_a

1&gt; 8 | | | f_a

1&gt;   | | | &lt;alignment member&gt; (size=4)

1&gt;16 | | | d_a

1&gt; | | +---

1&gt;24 | | c_b

1&gt;   | | &lt;alignment member&gt; (size=7)

1&gt; | +---

1&gt;32 | d_b

1&gt; +---
</code></pre>
<ul>
<li>
<p>每个派生类中起始位置都是<strong>Base class subobjectj基类子对象</strong></p>
</li>
<li>
<p>内存空间会按照类的继承顺序(父类到子类)和字段的声明顺序布局</p>
</li>
</ul>
<h2 id="22">2.2 有虚函数</h2>
<pre><code>class Base
{
private:
    char c_a;
    static char c_b;
    int i_a;
    static int i_b;
    float f_a;
    static float f_b;
    double d_a;
public:
    virtual void fun_1() {}
    virtual void fun_2() {}
};

//Derived1类
class Derived1 : public Base
{
    char c_b;

public:
    virtual void fun_d1() {}
    void fun_2() {}
};

//Derived2类
class Derived2 : public Derived1
{
    double d_b;

public:
    virtual void fun_d2() {}
};
</code></pre>
<h3 id="_6">布局</h3>
<pre><code>1&gt;class Base    size(32):
1&gt;  +---
1&gt; 0    | {vfptr}
1&gt; 8    | c_a
1&gt;      | &lt;alignment member&gt; (size=3)
1&gt;12    | i_a
1&gt;16    | f_a
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;24    | d_a
1&gt;  +---
1&gt;Base::$vftable@:
1&gt;  | &amp;Base_meta
1&gt;  |  0
1&gt; 0    | &amp;Base::fun_1
1&gt; 1    | &amp;Base::fun_2
1&gt;Base::fun_1 this adjustor: 0
1&gt;Base::fun_2 this adjustor: 0
1&gt;class Derived1    size(40):
1&gt;  +---
1&gt; 0    | +--- (base class Base)
1&gt; 0    | | {vfptr}
1&gt; 8    | | c_a
1&gt;      | | &lt;alignment member&gt; (size=3)
1&gt;12    | | i_a
1&gt;16    | | f_a
1&gt;      | | &lt;alignment member&gt; (size=4)
1&gt;24    | | d_a
1&gt;  | +---
1&gt;32    | c_b
1&gt;      | &lt;alignment member&gt; (size=7)
1&gt;  +---
1&gt;Derived1::$vftable@:
1&gt;  | &amp;Derived1_meta
1&gt;  |  0
1&gt; 0    | &amp;Base::fun_1
1&gt; 1    | &amp;Derived1::fun_2
1&gt; 2    | &amp;Derived1::fun_d1
1&gt;Derived1::fun_d1 this adjustor: 0
1&gt;Derived1::fun_2 this adjustor: 0
1&gt;class Derived2    size(48):
1&gt;  +---
1&gt; 0    | +--- (base class Derived1)
1&gt; 0    | | +--- (base class Base)
1&gt; 0    | | | {vfptr}
1&gt; 8    | | | c_a
1&gt;      | | | &lt;alignment member&gt; (size=3)
1&gt;12    | | | i_a
1&gt;16    | | | f_a
1&gt;      | | | &lt;alignment member&gt; (size=4)
1&gt;24    | | | d_a
1&gt;  | | +---
1&gt;32    | | c_b
1&gt;      | | &lt;alignment member&gt; (size=7)
1&gt;  | +---
1&gt;40    | d_b
1&gt;  +---
1&gt;Derived2::$vftable@:
1&gt;  | &amp;Derived2_meta
1&gt;  |  0
1&gt; 0    | &amp;Base::fun_1
1&gt; 1    | &amp;Derived1::fun_2
1&gt; 2    | &amp;Derived1::fun_d1
1&gt; 3    | &amp;Derived2::fun_d2
</code></pre>
<h3 id="_7">三、多重继承</h3>
<pre><code>class A
{
private:
    char c_a;
    static char c_b;
    int i_a;
    static int i_b;
    float f_a;
    static float f_b;
    double d_a;
public:
    void fun_A() {}
    virtual void vfun_A() {}
    virtual ~A() {}
};

class B
{
    char c_b;

public:
    void fun_B() {}
    virtual void vfun_B() {}
    virtual ~B() {}
};

class C : public A, public B
{
    double d_b;

public:
    void fun_C() {}
    virtual void vfun_C() {}
    virtual ~C() {}
};
</code></pre>
<h2 id="_8">布局</h2>
<pre><code>1&gt;class A   size(32):
1&gt;  +---
1&gt; 0    | {vfptr}
1&gt; 8    | c_a
1&gt;      | &lt;alignment member&gt; (size=3)
1&gt;12    | i_a
1&gt;16    | f_a
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;24    | d_a
1&gt;  +---
1&gt;A::$vftable@:
1&gt;  | &amp;A_meta
1&gt;  |  0
1&gt; 0    | &amp;A::vfun_A
1&gt; 1    | &amp;A::{dtor}
1&gt;A::vfun_A this adjustor: 0
1&gt;A::{dtor} this adjustor: 0
1&gt;A::__delDtor this adjustor: 0
1&gt;A::__vecDelDtor this adjustor: 0
1&gt;class B   size(16):
1&gt;  +---
1&gt; 0    | {vfptr}
1&gt; 8    | c_b
1&gt;      | &lt;alignment member&gt; (size=7)
1&gt;  +---
1&gt;B::$vftable@:
1&gt;  | &amp;B_meta
1&gt;  |  0
1&gt; 0    | &amp;B::vfun_B
1&gt; 1    | &amp;B::{dtor}
1&gt;B::vfun_B this adjustor: 0
1&gt;B::{dtor} this adjustor: 0
1&gt;B::__delDtor this adjustor: 0
1&gt;B::__vecDelDtor this adjustor: 0
1&gt;class C   size(56):
1&gt;  +---
1&gt; 0    | +--- (base class A)
1&gt; 0    | | {vfptr}
1&gt; 8    | | c_a
1&gt;      | | &lt;alignment member&gt; (size=3)
1&gt;12    | | i_a
1&gt;16    | | f_a
1&gt;      | | &lt;alignment member&gt; (size=4)
1&gt;24    | | d_a
1&gt;  | +---
1&gt;32    | +--- (base class B)
1&gt;32    | | {vfptr}
1&gt;40    | | c_b
1&gt;      | | &lt;alignment member&gt; (size=7)
1&gt;  | +---
1&gt;48    | d_b
1&gt;  +---
1&gt;C::$vftable@A@:
1&gt;  | &amp;C_meta
1&gt;  |  0
1&gt; 0    | &amp;A::vfun_A
1&gt; 1    | &amp;C::{dtor}
1&gt; 2    | &amp;C::vfun_C
1&gt;C::$vftable@B@:
1&gt;  | -32
1&gt; 0    | &amp;B::vfun_B
1&gt; 1    | &amp;thunk: this-=32; goto C::{dtor}
1&gt;C::vfun_C this adjustor: 0
1&gt;C::{dtor} this adjustor: 0
1&gt;C::__delDtor this adjustor: 0
1&gt;C::__vecDelDtor this adjustor: 0
</code></pre>
<ul>
<li>每个包含虚函数的父类都会有自己的虚函数表，并且按照继承顺序布局(虚表指针+字段）；</li>
<li>如果子类重写父类虚函数，都会在每一个相应的虚函数表中更新相应地址；</li>
<li>如果子类有自己的新定义的虚函数或者非虚成员函数，也会加到第一个虚函数表的后面。</li>
</ul>
<h1 id="_9">四、菱形继承</h1>
<p>菱形继承：类B和C均继承自类A，类D同时继承类B和C</p>
<pre><code>class A
{
private:
    char c_a;
    int i_a;
    float f_a;
    double d_a;
public:
    virtual ~A() {}
};

class B : public A
{
    int i_b;

public:
    virtual ~B() {}
};

class C : public A
{
    int i_c;

public:
    virtual ~C() {}
};

class D : public B, public C
{
    int i_d;

public:
    virtual ~D() {}
};
</code></pre>
<h2 id="_10">布局</h2>
<pre><code>1&gt;class A   size(32):
1&gt;  +---
1&gt; 0    | {vfptr}
1&gt; 8    | c_a
1&gt;      | &lt;alignment member&gt; (size=3)
1&gt;12    | i_a
1&gt;16    | f_a
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;24    | d_a
1&gt;  +---
1&gt;A::$vftable@:
1&gt;  | &amp;A_meta
1&gt;  |  0
1&gt; 0    | &amp;A::{dtor}
1&gt;A::{dtor} this adjustor: 0
1&gt;A::__delDtor this adjustor: 0
1&gt;A::__vecDelDtor this adjustor: 0
1&gt;class B   size(40):
1&gt;  +---
1&gt; 0    | +--- (base class A)
1&gt; 0    | | {vfptr}
1&gt; 8    | | c_a
1&gt;      | | &lt;alignment member&gt; (size=3)
1&gt;12    | | i_a
1&gt;16    | | f_a
1&gt;      | | &lt;alignment member&gt; (size=4)
1&gt;24    | | d_a
1&gt;  | +---
1&gt;32    | i_b
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;  +---
1&gt;B::$vftable@:
1&gt;  | &amp;B_meta
1&gt;  |  0
1&gt; 0    | &amp;B::{dtor}
1&gt;B::{dtor} this adjustor: 0
1&gt;B::__delDtor this adjustor: 0
1&gt;B::__vecDelDtor this adjustor: 0
1&gt;class C   size(40):
1&gt;  +---
1&gt; 0    | +--- (base class A)
1&gt; 0    | | {vfptr}
1&gt; 8    | | c_a
1&gt;      | | &lt;alignment member&gt; (size=3)
1&gt;12    | | i_a
1&gt;16    | | f_a
1&gt;      | | &lt;alignment member&gt; (size=4)
1&gt;24    | | d_a
1&gt;  | +---
1&gt;32    | i_c
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;  +---
1&gt;C::$vftable@:
1&gt;  | &amp;C_meta
1&gt;  |  0
1&gt; 0    | &amp;C::{dtor}
1&gt;C::{dtor} this adjustor: 0
1&gt;C::__delDtor this adjustor: 0
1&gt;C::__vecDelDtor this adjustor: 0
1&gt;class D   size(88):
1&gt;  +---
1&gt; 0    | +--- (base class B)
1&gt; 0    | | +--- (base class A)
1&gt; 0    | | | {vfptr}
1&gt; 8    | | | c_a
1&gt;      | | | &lt;alignment member&gt; (size=3)
1&gt;12    | | | i_a
1&gt;16    | | | f_a
1&gt;      | | | &lt;alignment member&gt; (size=4)
1&gt;24    | | | d_a
1&gt;  | | +---
1&gt;32    | | i_b
1&gt;      | | &lt;alignment member&gt; (size=4)
1&gt;  | +---
1&gt;40    | +--- (base class C)
1&gt;40    | | +--- (base class A)
1&gt;40    | | | {vfptr}
1&gt;48    | | | c_a
1&gt;      | | | &lt;alignment member&gt; (size=3)
1&gt;52    | | | i_a
1&gt;56    | | | f_a
1&gt;      | | | &lt;alignment member&gt; (size=4)
1&gt;64    | | | d_a
1&gt;  | | +---
1&gt;72    | | i_c
1&gt;      | | &lt;alignment member&gt; (size=4)
1&gt;  | +---
1&gt;80    | i_d
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;  +---
1&gt;D::$vftable@B@:
1&gt;  | &amp;D_meta
1&gt;  |  0
1&gt; 0    | &amp;D::{dtor}
1&gt;D::$vftable@C@:
1&gt;  | -40
1&gt; 0    | &amp;thunk: this-=40; goto D::{dtor}
1&gt;D::{dtor} this adjustor: 0
1&gt;D::__delDtor this adjustor: 0
1&gt;D::__vecDelDtor this adjustor: 0
</code></pre>
<p>如上class D，subobject A有两份，所以A的data member也存了两份，但实际上对于D而言，只需要有一份subobject A即够了。菱形继承不仅浪费存储空间，而且造成了数据访问的二义性。解决办法：虚继承</p>
<h1 id="_11">五、虚继承</h1>
<pre><code>class A
{
private:
    char c_a;
    int i_a;
    float f_a;
    double d_a;
public:
    virtual ~A() {}
};

class B : virtual public A
{
    int i_b;

public:
    virtual ~B() {}
};

class C : virtual public A
{
    int i_c;

public:
    virtual ~C() {}
};

class D : public B, public C
{
    int i_d;

public:
    virtual ~D() {}
};
</code></pre>
<h2 id="_12">布局</h2>
<pre><code>1&gt;class A   size(32):
1&gt;  +---
1&gt; 0    | {vfptr}
1&gt; 8    | c_a
1&gt;      | &lt;alignment member&gt; (size=3)
1&gt;12    | i_a
1&gt;16    | f_a
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;24    | d_a
1&gt;  +---
1&gt;A::$vftable@:
1&gt;  | &amp;A_meta
1&gt;  |  0
1&gt; 0    | &amp;A::{dtor}
1&gt;A::{dtor} this adjustor: 0
1&gt;A::__delDtor this adjustor: 0
1&gt;A::__vecDelDtor this adjustor: 0
1&gt;class B   size(48):
1&gt;  +---
1&gt; 0    | {vbptr}
1&gt; 8    | i_b
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;  +---
1&gt;  +--- (virtual base A)
1&gt;16    | {vfptr}
1&gt;24    | c_a
1&gt;      | &lt;alignment member&gt; (size=3)
1&gt;28    | i_a
1&gt;32    | f_a
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;40    | d_a
1&gt;  +---
1&gt;B::$vbtable@:
1&gt; 0    | 0
1&gt; 1    | 16 (Bd(B+0)A)
1&gt;B::$vftable@:
1&gt;  | -16
1&gt; 0    | &amp;B::{dtor}
1&gt;B::{dtor} this adjustor: 16
1&gt;B::__delDtor this adjustor: 16
1&gt;B::__vecDelDtor this adjustor: 16
1&gt;vbi:     class  offset o.vbptr  o.vbte fVtorDisp
1&gt;               A      16       0       4 0
1&gt;class C   size(48):
1&gt;  +---
1&gt; 0    | {vbptr}
1&gt; 8    | i_c
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;  +---
1&gt;  +--- (virtual base A)
1&gt;16    | {vfptr}
1&gt;24    | c_a
1&gt;      | &lt;alignment member&gt; (size=3)
1&gt;28    | i_a
1&gt;32    | f_a
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;40    | d_a
1&gt;  +---
1&gt;C::$vbtable@:
1&gt; 0    | 0
1&gt; 1    | 16 (Cd(C+0)A)
1&gt;C::$vftable@:
1&gt;  | -16
1&gt; 0    | &amp;C::{dtor}
1&gt;C::{dtor} this adjustor: 16
1&gt;C::__delDtor this adjustor: 16
1&gt;C::__vecDelDtor this adjustor: 16
1&gt;vbi:     class  offset o.vbptr  o.vbte fVtorDisp
1&gt;               A      16       0       4 0
1&gt;class D   size(72):
1&gt;  +---
1&gt; 0    | +--- (base class B)
1&gt; 0    | | {vbptr}
1&gt; 8    | | i_b
1&gt;      | | &lt;alignment member&gt; (size=4)
1&gt;  | +---
1&gt;16    | +--- (base class C)
1&gt;16    | | {vbptr}
1&gt;24    | | i_c
1&gt;      | | &lt;alignment member&gt; (size=4)
1&gt;  | +---
1&gt;32    | i_d
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;  +---
1&gt;  +--- (virtual base A)
1&gt;40    | {vfptr}
1&gt;48    | c_a
1&gt;      | &lt;alignment member&gt; (size=3)
1&gt;52    | i_a
1&gt;56    | f_a
1&gt;      | &lt;alignment member&gt; (size=4)
1&gt;64    | d_a
1&gt;  +---
1&gt;D::$vbtable@B@:
1&gt; 0    | 0
1&gt; 1    | 40 (Dd(B+0)A)
1&gt;D::$vbtable@C@:
1&gt; 0    | 0
1&gt; 1    | 24 (Dd(C+0)A)
1&gt;D::$vftable@:
1&gt;  | -40
1&gt; 0    | &amp;D::{dtor}
1&gt;D::{dtor} this adjustor: 40
1&gt;D::__delDtor this adjustor: 40
1&gt;D::__vecDelDtor this adjustor: 40
1&gt;vbi:     class  offset o.vbptr  o.vbte fVtorDisp
1&gt;               A      40       0       4 0
